ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/em_eeprom/cy_em_eeprom.c
/***************************************************************************//**
* \file cy_em_eeprom.c
* \version 1.0
*
* \brief
*  This file provides source code of the API for the Emulated EEPROM library.
*  The Emulated EEPROM API allows creating of an emulated EEPROM in flash that
*  has the ability to do wear leveling and restore corrupted data from a
*  redundant copy.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include <string.h>

#include "em_eeprom/cy_em_eeprom.h"


#if defined(__cplusplus)
extern "C" {
#endif


/***************************************
* Private Function Prototypes
***************************************/
static void FindLastWrittenRow(uint32_t * lastWrRowPtr, cy_stc_eeprom_context_t * context);
static uint32_t GetRowAddrBySeqNum(uint32_t seqNum, cy_stc_eeprom_context_t * context);
static uint8_t CalcChecksum(uint8_t rowData[], uint32_t len);
static void GetNextRowToWrite(uint32_t seqNum,
        uint32_t * rowToWrPtr, uint32_t * rowToRdPtr, cy_stc_eeprom_context_t * context);
static cy_en_em_eeprom_status_t CheckRanges(cy_stc_eeprom_config_t* config);
static cy_en_em_eeprom_status_t WriteRow(uint32_t rowAddr, uint32_t *rowData, cy_stc_eeprom_context_t * context);
static cy_en_em_eeprom_status_t EraseRow(uint32_t rowAddr, uint32_t ramBuffAddr, cy_stc_eeprom_context_t * context);
static cy_en_em_eeprom_status_t CheckCrcAndCopy(uint32_t startAddr,
    uint32_t dstAddr, uint32_t rowOffset, uint32_t numBytes, cy_stc_eeprom_context_t * context);
static uint32_t GetAddresses(uint32_t *startAddr, uint32_t *endAddr, uint32_t *offset, uint32_t rowNum, uint32_t addr, uint32_t len);


/**
* \addtogroup group_em_eeprom_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_Em_EEPROM_Init
****************************************************************************//**
*
* Initializes the Emulated EEPROM library.
*
* \param config
* The pointer to a configuration structure. See \ref cy_stc_eeprom_config_t.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
cy_en_em_eeprom_status_t
        Cy_Em_EEPROM_Init(cy_stc_eeprom_config_t* config, cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_PARAM;

    if((NULL != context) && (NULL != config) && (NULL != ((uint32_t *)config->userFlashStartAddr)) &&
        (config->wearLevelingFactor <= CY_EM_EEPROM_MAX_WEAR_LEVELING_FACTOR) && (config->eepromSize != 0u))
    {
        ret = CheckRanges(config);

        if(CY_EM_EEPROM_SUCCESS == ret)
        {
            /* Copy the user config structure fields into context */
            context->eepromSize = config->eepromSize;
            context->wearLevelingFactor = config->wearLevelingFactor;
            context->redundantCopy = config->redundantCopy;
            context->blockingWrite = config->blockingWrite;
            context->userFlashStartAddr = config->userFlashStartAddr;
            /* Store frequently used data for internal use */
            context->numberOfRows =  CY_EM_EEPROM_GET_NUM_ROWS_IN_EEPROM(config->eepromSize);
            context->wlEndAddr = ((CY_EM_EEPROM_GET_EEPROM_SIZE(context->numberOfRows) * config->wearLevelingFactor) +
                    config->userFlashStartAddr);
            /* Find last written EEPROM row and store it for quick access */
            FindLastWrittenRow(&context->lastWrRowAddr, context);
        }
    }

    return(ret);
}


/*******************************************************************************
* Function Name: Cy_Em_EEPROM_Read
****************************************************************************//**
*
* This function takes the logical EEPROM address, converts it to the actual
* physical address where the data is stored and returns the data to the user.
*
* \param addr
* The logical start address in EEPROM to start reading data from.
*
* \param eepromData
* The pointer to a user array to write data to.
*
* \param size
* The amount of data to read.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* This function returns \ref cy_en_em_eeprom_status_t.
*
* \note
* This function uses a buffer of the flash row size to perform read
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
* In case in if redundant copy option is enabled the function may perform writes
* to EEPROM. This is done in case if the data in the EEPPROM is corrupted and
* the data in redundant copy is valid based on CRC-8 data integrity check.
*
*******************************************************************************/
cy_en_em_eeprom_status_t
    Cy_Em_EEPROM_Read(uint32_t addr, void * eepromData, uint32_t size, cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_PARAM;
    uint32_t i;
    uint32_t numBytesToRead;
    uint32_t curEepromBaseAddr;
    uint32_t curRowOffset;
    uint32_t startRowAddr;
    uint32_t actEepromRowNum;
    uint32_t curRdEepromRowNum = 0u;
    uint32_t dataStartEepromRowNum = 0u;
    uint32_t eeData = (uint32_t) eepromData; /* To avoid the pointer arithmetic with void */

    /* Validate input parameters */
    if((0u != size) && ((addr + size) <= (context->eepromSize)) && (NULL != eepromData))
    {
        uint32_t rdAddr = addr;
        uint32_t rdSize = size;
        /* Get the sequence number of the last written row */
        uint32_t seqNum = CY_GET_REG32(context->lastWrRowAddr);

        if(0u != seqNum)
        {
            uint32_t updateAddrFlag = 0u;

