ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/em_eeprom/cy_em_eeprom.c
            /* Calculate the number of the row read operations. Currently this only concerns
            * the reads from the EEPROM data locations.
            */
            uint32_t numRowReads = ((((rdAddr + rdSize) - 1u) / CY_EM_EEPROM_EEPROM_DATA_LEN) -
                                  (rdAddr / CY_EM_EEPROM_EEPROM_DATA_LEN)) + 1u;

            /* Get the address of the first row of the currently active EEPROM sector. If
            * no wear leveling is used - the EEPROM has only one sector, so use the base
            * addr stored in "context->userFlashStartAddr".
            */
            curEepromBaseAddr = (((context->lastWrRowAddr - context->userFlashStartAddr) /
                                  (CY_EM_EEPROM_FLASH_SIZEOF_ROW * context->numberOfRows)) *
                                  (CY_EM_EEPROM_FLASH_SIZEOF_ROW * context->numberOfRows)) +
                                   context->userFlashStartAddr;

            /* Find the number of the row that contains the start address of the data */
            for(i = 0u; i < context->numberOfRows; i++)
            {
                if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(rdAddr, i))
                {
                    dataStartEepromRowNum = i;
                    curRdEepromRowNum = dataStartEepromRowNum;
                    break;
                }
            }

            /* Find the row number of the last written row */
            actEepromRowNum = (context->lastWrRowAddr - curEepromBaseAddr) / CY_EM_EEPROM_FLASH_SIZEOF_ROW;

            /* Check if wear leveling is used */
            if(context->wearLevelingFactor > 1u)
            {
                uint32_t dataEndEepromRowNum = dataStartEepromRowNum + (numRowReads - 1u);

                /* Check if the future validation of the read address is required. */
                updateAddrFlag = (dataStartEepromRowNum > actEepromRowNum) ? 1u :
                                  ((dataEndEepromRowNum > actEepromRowNum) ? 1u : 0u);
            }

            /* Copy data from the EEPROM data locations to the user buffer */
            for(i = 0u; i < numRowReads; i++)
            {
                startRowAddr = curEepromBaseAddr + (curRdEepromRowNum * CY_EM_EEPROM_FLASH_SIZEOF_ROW);
                curRowOffset = CY_EM_EEPROM_EEPROM_DATA_LEN + (rdAddr % CY_EM_EEPROM_EEPROM_DATA_LEN);

                /* Check if there are more reads pending and update the number of the
                * remaining bytes to read respectively.
                */
                if((i + 1u) < numRowReads)
                {
                    numBytesToRead = CY_EM_EEPROM_EEPROM_DATA_LEN - (rdAddr % CY_EM_EEPROM_EEPROM_DATA_LEN);
                }
                else
                {
                    numBytesToRead = rdSize;
                }

                /* Check if the read address needs to be updated to point to the correct
                * EEPROM sector.
                */
                if((0u != updateAddrFlag) && (curRdEepromRowNum > actEepromRowNum))
                {
                    startRowAddr -= context->numberOfRows * CY_EM_EEPROM_FLASH_SIZEOF_ROW;

                    if(startRowAddr < context->userFlashStartAddr)
                    {
                        startRowAddr = context->wlEndAddr -
                            ((context->numberOfRows - curRdEepromRowNum) * CY_EM_EEPROM_FLASH_SIZEOF_ROW);
                    }
                }

                if(0u != context->redundantCopy)
                {
                    /* Check a checksum of the EEPROM row and if it is bad, check a checksum in
                    * the corresponding row in redundant copy, otherwise return failure.
                    */
                    ret = CheckCrcAndCopy(startRowAddr, eeData, curRowOffset, numBytesToRead, context);

                    if(CY_EM_EEPROM_SUCCESS != ret)
                    {
                        break;
                    }
                }
                else
                {
                    /* Copy the data to the user buffer */
                    (void)memcpy((void *)(eeData),
                                 (void *)(startRowAddr + curRowOffset),
                                 numBytesToRead);

                    /* Indicate success to be able to execute next code block */
                    ret = CY_EM_EEPROM_SUCCESS;
                }

                /* Update variables anticipated in the read operation */
                rdAddr += numBytesToRead;
                rdSize -= numBytesToRead;
                eeData += numBytesToRead;
                curRdEepromRowNum++;
            }

            /* This code block will copy the latest data from the EEPROM headers into the
            * user buffer. The data previously copied into the user buffer may be updated
            * as the EEPROM headers contain more recent data.
            */
            if(CY_EM_EEPROM_SUCCESS == ret)
            {
                numRowReads = context->numberOfRows - 1u;

                for(i = (seqNum - numRowReads); i <= seqNum; i++)
                {
                    startRowAddr = GetRowAddrBySeqNum(i, context);
                    
                    if (0u != startRowAddr)
                    {
                        /* The following variables are introduced to increase code readability. */
                        uint32_t startAddr  = *(uint32_t *)(startRowAddr + CY_EM_EEPROM_HEADER_ADDR_OFFSET);
                        uint32_t endAddr    = startAddr + (*(uint32_t *)(startRowAddr + CY_EM_EEPROM_HEADER_LEN_OFFSET));

                        /* Check if the current row EEPROM header contains the data requested for read */
                        if(0u != CY_EM_EEPROM_IS_ADDRESES_CROSSING(startAddr, endAddr, addr, addr + size))
                        {
                            rdAddr = (startAddr > addr) ? (startAddr) : (addr);

                            /* Calculate the number of bytes to be read from the current row's EEPROM header */
                            numBytesToRead = ((endAddr < (addr + size)) ? endAddr : (addr + size)) - rdAddr;

                            /* Calculate the offset in the user buffer from which the data will be updated. */
                            eeData = ((uint32_t)eepromData) + (rdAddr - addr);

                            /* Check a checksum of the EEPROM row and if it is bad, check a checksum in the
                            * corresponding row in redundant copy, otherwise return failure. Copy the data
                            * from the recent EEPROM headers to the user buffer. This will overwrite the
                            * data copied form EEPROM data locations as the data in EEPROM headers is newer.
                            */
                            if(0u != context->redundantCopy)
                            {
                                ret = CheckCrcAndCopy(startRowAddr, eeData,
                                                      CY_EM_EEPROM_HEADER_DATA_OFFSET, numBytesToRead, context);

                                if(CY_EM_EEPROM_SUCCESS != ret)
                                {
                                    break;
                                }
                            }
                            else
                            {
                                (void)memcpy((void *)(eeData),
                                             (void *)(startRowAddr + CY_EM_EEPROM_HEADER_DATA_OFFSET),
                                             numBytesToRead);
                            }
                        }
                    }
                }
            }
        }
        else
        {
            /* No records in the EEPROM */
            ret = CY_EM_EEPROM_BAD_DATA;
        }
    }

    return(ret);
}


