ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/em_eeprom/cy_em_eeprom.c
/*******************************************************************************
* Function Name: CalcChecksum
****************************************************************************//**
*
* Implements CRC-8 that is used in checksum calculation for the redundant copy
* algorithm.
*
* \param rowData
* The row data to be used to calculate the checksum.
*
* \param len
* The length of rowData.
*
* \return
* The calculated value of CRC-8.
*
*******************************************************************************/
static uint8_t CalcChecksum(uint8_t rowData[], uint32_t len)
{
    uint8_t crc = CY_EM_EEPROM_CRC8_SEED;
    uint8_t i;
    uint16_t cnt = 0u;

    while(cnt != len)
    {
        crc ^= rowData[cnt];
        for (i = 0u; i < CY_EM_EEPROM_CRC8_POLYNOM_LEN; i++)
        {
            crc = CY_EM_EEPROM_CALCULATE_CRC8(crc);
        }
        cnt++;
    }

    return (crc);
}


/*******************************************************************************
* Function Name: CheckRanges
****************************************************************************//**
*
* Checks if the EEPROM of the requested size can be placed in flash.
*
* \param config
* The pointer to a configuration structure. See \ref cy_stc_eeprom_config_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t CheckRanges(cy_stc_eeprom_config_t* config)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_BAD_DATA;
    uint32_t startAddr = config->userFlashStartAddr;
    uint32_t endAddr = startAddr + CY_EM_EEPROM_GET_PHYSICAL_SIZE(config->eepromSize,
            config->wearLevelingFactor, config->redundantCopy);

    /* Range check if there is enough flash for EEPROM */
    if (CY_EM_EEPROM_IS_IN_FLASH_RANGE(startAddr, endAddr))
    {
        ret = CY_EM_EEPROM_SUCCESS;
    }
    return (ret);
}


/*******************************************************************************
* Function Name: WriteRow
****************************************************************************//**
*
* Writes one flash row starting from the specified row address.
*
* \param rowAdd
* The address of the flash row.
*
* \param rowData
* The pointer to the data to be written to the row.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t WriteRow(uint32_t rowAddr, uint32_t *rowData,
        cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_WRITE_FAIL;
    if(0u != context->blockingWrite)
    {
        /* Do blocking write */
        if(CY_FLASH_DRV_SUCCESS == Cy_Flash_WriteRow(rowAddr, (const uint32_t *)rowData))
        {
            ret = CY_EM_EEPROM_SUCCESS;
        }
    }
    else
    {
        /* Initiate write */
        if(CY_FLASH_DRV_OPERATION_STARTED == Cy_Flash_StartWrite(rowAddr, (const uint32_t *)rowData))
        {
            uint32_t countMs = CY_EM_EEPROM_MAX_WRITE_DURATION_MS;
            cy_en_flashdrv_status_t rc;

            do
            {
                CyDelay(1u);                         /* Wait 1ms */
                rc = Cy_Flash_IsWriteComplete();     /* Check if write completed */
                countMs--;
            }
            while ((rc == CY_FLASH_DRV_OPCODE_BUSY) && (0u != countMs));

            if(CY_FLASH_DRV_SUCCESS == rc)
            {
                ret = CY_EM_EEPROM_SUCCESS;
            }
        }
    }

    return (ret);
}


/*******************************************************************************
* Function Name: EraseRow
****************************************************************************//**
*
* Erases one flash row starting from the specified row address. If the redundant
* copy option is enabled the corresponding row in the redundant copy will also
* be erased.
*
* \param rowAdd
* The address of the flash row.
*
* \param ramBuffAddr
* The address of the RAM buffer that contains zeroed data (used only for
* non-PSoC 6 devices).
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t EraseRow(uint32_t rowAddr, uint32_t ramBuffAddr,
    cy_stc_eeprom_context_t * context)
{
    uint32_t emEepromRowAddr = rowAddr;
    cy_en_em_eeprom_status_t ret = CY_EM_EEPROM_WRITE_FAIL;
    uint32_t i = 1u;

    ramBuffAddr = ramBuffAddr; /* To avoid compiler warning */

    if(0u != context->redundantCopy)
    {
        i++;
    }

    do
    {
        if(0u != context->blockingWrite)
        {
            /* Erase the flash row */
            if(CY_FLASH_DRV_SUCCESS == Cy_Flash_EraseRow(emEepromRowAddr))
            {
                ret = CY_EM_EEPROM_SUCCESS;
            }
        }
        else
        {
            /* Initiate erase */
            if(CY_FLASH_DRV_OPERATION_STARTED == Cy_Flash_StartErase(emEepromRowAddr))
            {
                uint32_t countMs = CY_EM_EEPROM_MAX_WRITE_DURATION_MS;
                cy_en_flashdrv_status_t rc;

                do
                {
                    CyDelay(1u);                         /* Wait 1ms */
                    rc = Cy_Flash_IsWriteComplete();     /* Check if erase completed */
                    countMs--;
                }
                while ((rc == CY_FLASH_DRV_OPCODE_BUSY) && (0u != countMs));

                if(CY_FLASH_DRV_SUCCESS == rc)
                {
                    ret = CY_EM_EEPROM_SUCCESS;
                }
            }
        }

        if(CY_EM_EEPROM_SUCCESS == ret)
        {
            /* Update the address to point to the redundant copy row */
            emEepromRowAddr = (emEepromRowAddr - context->userFlashStartAddr) + context->wlEndAddr;
        }
        else
        {
            break;
        }
        i--;
    } while (0u != i);

    return(ret);
}


