ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/em_eeprom/cy_em_eeprom.c
/*******************************************************************************
* Function Name: CheckCrcAndCopy
****************************************************************************//**
*
* Checks the checksum of the specific row in EEPROM. If the CRC matches - copies
* the data to the "datAddr" from EEPROM. f the CRC does not match checks the
* CRC of the corresponding row in the EEPROM's redundant copy. If the CRC
* matches - copies the data to the "datAddr" from EEPROM redundant copy. If the
* CRC of the redundant copy does not match - returns bad checksum.
*
* \param startAddr
* The address that points to the start of the specified row.
*
* \param datAddr
* The start address of where the row data will be copied if the CRC check
* will succeed.
*
* \param rowOffset
* The offset in the row from which the data should be copied.
*
* \param numBytes
* The number of bytes to be copied.
*
* \param context
* The pointer to the EEPROM context structure \ref cy_stc_eeprom_context_t.
*
* \return
* error / status code. See \ref cy_en_em_eeprom_status_t.
*
* \note
* This function uses a buffer of the flash row size to perform read
* operation. For the size of the row refer to the specific PSoC device
* datasheet.
*
*******************************************************************************/
static cy_en_em_eeprom_status_t CheckCrcAndCopy(uint32_t startAddr,
    uint32_t dstAddr, uint32_t rowOffset, uint32_t numBytes, cy_stc_eeprom_context_t * context)
{
    cy_en_em_eeprom_status_t ret;
    uint32_t writeRamBuffer[CY_EM_EEPROM_FLASH_SIZEOF_ROW / CY_EM_EEPROM_U32_DIV];

    /* Calculate the row address in the EEPROM's redundant copy */
    uint32_t rcStartRowAddr = (startAddr - context->userFlashStartAddr) + context->wlEndAddr;

    /* Check the row data CRC in the EEPROM */
    if((*(uint32_t *)(startAddr + CY_EM_EEPROM_HEADER_CHECKSUM_OFFSET)) ==
        ((uint32_t) CalcChecksum((uint8_t *)(startAddr + CY_EM_EEPROM_EEPROM_DATA_OFFSET),
            CY_EM_EEPROM_EEPROM_DATA_LEN)))
    {
        (void)memcpy((void *)(dstAddr), (void *)(startAddr + rowOffset), numBytes);

        ret = CY_EM_EEPROM_SUCCESS;
    }
    /* Check the row data CRC in the EEPROM's redundant copy */
    else if((*(uint32_t *)(rcStartRowAddr + CY_EM_EEPROM_HEADER_CHECKSUM_OFFSET)) ==
            ((uint32_t) CalcChecksum((uint8_t *)(rcStartRowAddr + CY_EM_EEPROM_EEPROM_DATA_OFFSET),
                CY_EM_EEPROM_EEPROM_DATA_LEN)))
    {
        /* Copy the redundant copy row to RAM buffer to avoid read while write (RWW)
        * flash exception. The RWW occurs while trying to write and read the data from
        * same flash macro.
        */
        (void)memcpy((void *)(writeRamBuffer), (void *)(rcStartRowAddr), CY_EM_EEPROM_FLASH_SIZEOF_ROW);

        /* Restore bad row data from the RAM buffer */
        ret = WriteRow(startAddr, (uint32_t *)writeRamBuffer, context);

        if(CY_EM_EEPROM_SUCCESS == ret)
        {
            (void)memcpy((void *)(dstAddr), (void *)(writeRamBuffer + rowOffset), numBytes);
        }
    }
    else
    {
        ret = CY_EM_EEPROM_BAD_CHECKSUM;
    }

    return(ret);
}


/*******************************************************************************
* Function Name: GetAddresses
****************************************************************************//**
*
* Calculates the start and end address of the row's EEPROM data to be updated.
* The start and end are not absolute addresses but a relative addresses in a
* flash row.
*
* \param startAddr
* The pointer the address where the EEPROM data start address will be returned.
*
* \param endAddr
* The pointer the address where the EEPROM data end address will be returned.
*
* \param offset
* The pointer the address where the calculated offset of the EEPROM header data
* will be returned.
*
* \param rowNum
* The row number that is about to be written.
*
* \param addr
* The address of the EEPROM header data in the currently analyzed row that may
* concern to the row about to be written.
*
* \param len
* The length of the EEPROM header data in the currently analyzed row that may
* concern to the row about to be written.
*
* \return
* Zero indicates that the currently analyzed row has the data to be written to
* the active EEPROM row data locations. Non zero value indicates that there is
* no data to be written
*
*******************************************************************************/
static uint32_t GetAddresses(uint32_t *startAddr, uint32_t *endAddr, uint32_t *offset, uint32_t rowNum,
    uint32_t addr, uint32_t len)
{
    uint32_t skip = 0u;

    *offset =0u;

    if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(addr, rowNum))
    {
        *startAddr = CY_EM_EEPROM_EEPROM_DATA_LEN + (addr % CY_EM_EEPROM_EEPROM_DATA_LEN);

        if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(addr + len, rowNum))
        {
            *endAddr = *startAddr + len;
        }
        else
        {
            *endAddr = CY_EM_EEPROM_FLASH_SIZEOF_ROW;
        }
    }
    else
    {

        if(0u != CY_EM_EEPROM_IS_ADDR_IN_ROW_RANGE(addr + len, rowNum))
        {
            *startAddr = CY_EM_EEPROM_EEPROM_DATA_LEN;
            *endAddr = (*startAddr + len) - (*startAddr - (addr % CY_EM_EEPROM_EEPROM_DATA_LEN));
            *offset = len - (*endAddr - *startAddr);
        }
        else
        {
            skip++;
        }
    }

    return (skip);
}


/** \endcond */

#if defined(__cplusplus)
}
#endif

/* [] END OF FILE */

